Revit 2027 API
EnergyDataSettings.CheckProjectReportType Method
 Checks that the project report type falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckProjectReportType(
	HVACLoadLoadsReportType projectReportType
)
Public Shared Function CheckProjectReportType (
	projectReportType As HVACLoadLoadsReportType
) As Boolean
public:
static bool CheckProjectReportType(
	HVACLoadLoadsReportType projectReportType
)
static member CheckProjectReportType :
        projectReportType : HVACLoadLoadsReportType -> bool
Parameters
projectReportType HVACLoadLoadsReportType
 The project report type to be checked.
Return Value
Boolean
 True if the project report type falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace